#### ✨ Terraform Plan (Prod Environment) 🚀

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloud_run.google_cloud_run_v2_service.app will be created
  + resource "google_cloud_run_v2_service" "app" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + labels                  = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "financia-api"
      + observed_generation     = (known after apply)
      + project                 = "prod-ai-agents-projects"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = 80
          + service_account                  = (known after apply)
          + timeout                          = "300s"

          + containers {
              + image = "us-central1-docker.pkg.dev/prod-ai-agents-projects/financia/api:v1.0.0"

              + env {
                  + name  = "ENVIRONMENT"
                  + value = "prod"
                }
              + env {
                  + name  = "GCP_PROJECT_ID"
                  + value = "prod-ai-agents-projects"
                }
              + env {
                  + name  = "GEMINI_MODEL"
                  + value = "gemini-pro"
                }
              + env {
                  + name  = "LOG_LEVEL"
                  + value = "INFO"
                }
              + env {
                  + name = "SPREADSHEET_ID"
                }
              + env {
                  + name = "WHATSAPP_WEBHOOK_VERIFY_TOKEN"
                }
              + env {
                  + name = "GEMINI_API_KEY"

                  + value_source {
                      + secret_key_ref {
                          + secret  = (known after apply)
                          + version = (known after apply)
                        }
                    }
                }
              + env {
                  + name = "GOOGLE_CLIENT_ID"

                  + value_source {
                      + secret_key_ref {
                          + secret  = (known after apply)
                          + version = (known after apply)
                        }
                    }
                }
              + env {
                  + name = "GOOGLE_CLIENT_SECRET"

                  + value_source {
                      + secret_key_ref {
                          + secret  = (known after apply)
                          + version = (known after apply)
                        }
                    }
                }
              + env {
                  + name = "GOOGLE_REFRESH_TOKEN"

                  + value_source {
                      + secret_key_ref {
                          + secret  = (known after apply)
                          + version = (known after apply)
                        }
                    }
                }
              + env {
                  + name = "WHATSAPP_API_KEY"

                  + value_source {
                      + secret_key_ref {
                          + secret  = (known after apply)
                          + version = (known after apply)
                        }
                    }
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 0
                  + period_seconds        = 10
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/health"
                      + port = 8080
                    }
                }

              + ports {
                  + container_port = 8080
                  + name           = "http1"
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 0
                  + period_seconds        = 3
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/health"
                      + port = 8080
                    }
                }
            }

          + scaling {
              + max_instance_count = 20
              + min_instance_count = 1
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.cloud_run.google_cloud_run_v2_service_iam_member.public_access will be created
  + resource "google_cloud_run_v2_service_iam_member" "public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + name     = "financia-api"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

  # module.iam.google_project_iam_member.app_error_writer will be created
  + resource "google_project_iam_member" "app_error_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-ai-agents-projects"
      + role    = "roles/errorreporting.writer"
    }

  # module.iam.google_project_iam_member.app_log_writer will be created
  + resource "google_project_iam_member" "app_log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-ai-agents-projects"
      + role    = "roles/logging.logWriter"
    }

  # module.iam.google_project_iam_member.app_metric_writer will be created
  + resource "google_project_iam_member" "app_metric_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-ai-agents-projects"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.iam.google_project_iam_member.app_secret_accessor will be created
  + resource "google_project_iam_member" "app_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-ai-agents-projects"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.iam.google_project_iam_member.app_trace_agent will be created
  + resource "google_project_iam_member" "app_trace_agent" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-ai-agents-projects"
      + role    = "roles/cloudtrace.agent"
    }

  # module.iam.google_service_account.app will be created
  + resource "google_service_account" "app" {
      + account_id   = "financia-app-prod"
      + description  = "Service account for Financia Cloud Run service in prod"
      + disabled     = false
      + display_name = "Financia Application Service Account (prod)"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "prod-ai-agents-projects"
      + unique_id    = (known after apply)
    }

  # module.monitoring.google_logging_project_sink.app_logs[0] will be created
  + resource "google_logging_project_sink" "app_logs" {
      + description            = "Log sink for financia-api in prod"
      + destination            = "logging.googleapis.com/projects/prod-ai-agents-projects/locations/global/buckets/_Default"
      + filter                 = <<-EOT
            resource.type="cloud_run_revision"
            resource.labels.service_name="financia-api"
        EOT
      + id                     = (known after apply)
      + name                   = "financia-api-logs-prod"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)
    }

  # module.monitoring.google_monitoring_alert_policy.high_error_rate[0] will be created
  + resource "google_monitoring_alert_policy" "high_error_rate" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "[PROD] High Error Rate - financia-api"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "prod-ai-agents-projects"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "Error rate above 5%"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = <<-EOT
                    resource.type="cloud_run_revision"
                    resource.labels.service_name="financia-api"
                    metric.type="run.googleapis.com/request_count"
                    metric.labels.response_code_class="5xx"
                EOT
              + threshold_value = 5

              + aggregations {
                  + alignment_period   = "60s"
                  + per_series_aligner = "ALIGN_RATE"
                }
            }
        }

      + documentation {
          + content   = "Error rate for financia-api in prod has exceeded 5%. Check logs at https://console.cloud.google.com/logs"
          + mime_type = "text/markdown"
        }
    }

  # module.monitoring.google_monitoring_alert_policy.high_latency[0] will be created
  + resource "google_monitoring_alert_policy" "high_latency" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "[PROD] High Latency - financia-api"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "prod-ai-agents-projects"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "P95 latency above 5 seconds"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = <<-EOT
                    resource.type="cloud_run_revision"
                    resource.labels.service_name="financia-api"
                    metric.type="run.googleapis.com/request_latencies"
                EOT
              + threshold_value = 5000

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_PERCENTILE_95"
                  + group_by_fields      = [
                      + "resource.service_name",
                    ]
                  + per_series_aligner   = "ALIGN_DELTA"
                }
            }
        }

      + documentation {
          + content   = "Request latency (P95) for financia-api in prod has exceeded 5 seconds."
          + mime_type = "text/markdown"
        }
    }

  # module.monitoring.google_monitoring_alert_policy.service_down[0] will be created
  + resource "google_monitoring_alert_policy" "service_down" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "[PROD] Service Down - financia-api"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "prod-ai-agents-projects"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "No requests in 5 minutes"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_LT"
              + duration        = "300s"
              + filter          = <<-EOT
                    resource.type="cloud_run_revision"
                    resource.labels.service_name="financia-api"
                    metric.type="run.googleapis.com/request_count"
                EOT
              + threshold_value = 1

              + aggregations {
                  + alignment_period   = "60s"
                  + per_series_aligner = "ALIGN_RATE"
                }
            }
        }

      + documentation {
          + content   = "🚨 financia-api in prod appears to be down - no requests received in the last 5 minutes."
          + mime_type = "text/markdown"
        }
    }

  # module.monitoring.google_monitoring_dashboard.app_dashboard will be created
  + resource "google_monitoring_dashboard" "app_dashboard" {
      + dashboard_json = jsonencode(
            {
              + displayName  = "financia-api - prod"
              + mosaicLayout = {
                  + columns = 12
                  + tiles   = [
                      + {
                          + height = 4
                          + widget = {
                              + title   = "Request Count"
                              + xyChart = {
                                  + dataSets = [
                                      + {
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod  = "60s"
                                                      + perSeriesAligner = "ALIGN_RATE"
                                                    }
                                                  + filter      = "resource.type=\"cloud_run_revision\" resource.labels.service_name=\"financia-api\" metric.type=\"run.googleapis.com/request_count\""
                                                }
                                            }
                                        },
                                    ]
                                }
                            }
                          + width  = 6
                        },
                      + {
                          + height = 4
                          + widget = {
                              + title   = "Request Latency (P50, P95, P99)"
                              + xyChart = {
                                  + dataSets = [
                                      + {
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod    = "60s"
                                                      + crossSeriesReducer = "REDUCE_PERCENTILE_95"
                                                      + perSeriesAligner   = "ALIGN_DELTA"
                                                    }
                                                  + filter      = "resource.type=\"cloud_run_revision\" resource.labels.service_name=\"financia-api\" metric.type=\"run.googleapis.com/request_latencies\""
                                                }
                                            }
                                        },
                                    ]
                                }
                            }
                          + width  = 6
                          + xPos   = 6
                        },
                    ]
                }
            }
        )
      + id             = (known after apply)
      + project        = "prod-ai-agents-projects"
    }

  # module.monitoring.google_monitoring_notification_channel.email[0] will be created
  + resource "google_monitoring_notification_channel" "email" {
      + display_name        = "Email Notifications - prod"
      + enabled             = true
      + force_delete        = false
      + id                  = (known after apply)
      + labels              = {
          + "email_address" = "your-email@example.com"
        }
      + name                = (known after apply)
      + project             = "prod-ai-agents-projects"
      + type                = "email"
      + verification_status = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret.secrets["GEMINI_API_KEY_PROD"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "prod-ai-agents-projects"
      + secret_id             = "GEMINI_API_KEY_PROD"
      + terraform_labels      = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secret_manager.google_secret_manager_secret.secrets["GOOGLE_CLIENT_ID_PROD"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "prod-ai-agents-projects"
      + secret_id             = "GOOGLE_CLIENT_ID_PROD"
      + terraform_labels      = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secret_manager.google_secret_manager_secret.secrets["GOOGLE_CLIENT_SECRET_PROD"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "prod-ai-agents-projects"
      + secret_id             = "GOOGLE_CLIENT_SECRET_PROD"
      + terraform_labels      = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secret_manager.google_secret_manager_secret.secrets["GOOGLE_REFRESH_TOKEN_PROD"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "prod-ai-agents-projects"
      + secret_id             = "GOOGLE_REFRESH_TOKEN_PROD"
      + terraform_labels      = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secret_manager.google_secret_manager_secret.secrets["WHATSAPP_API_KEY_PROD"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + name                  = (known after apply)
      + project               = "prod-ai-agents-projects"
      + secret_id             = "WHATSAPP_API_KEY_PROD"
      + terraform_labels      = {
          + "app"         = "financia"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.secret_manager.google_secret_manager_secret_iam_member.app_access["GEMINI_API_KEY_PROD"] will be created
  + resource "google_secret_manager_secret_iam_member" "app_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "prod-ai-agents-projects"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_iam_member.app_access["GOOGLE_CLIENT_ID_PROD"] will be created
  + resource "google_secret_manager_secret_iam_member" "app_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "prod-ai-agents-projects"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_iam_member.app_access["GOOGLE_CLIENT_SECRET_PROD"] will be created
  + resource "google_secret_manager_secret_iam_member" "app_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "prod-ai-agents-projects"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_iam_member.app_access["GOOGLE_REFRESH_TOKEN_PROD"] will be created
  + resource "google_secret_manager_secret_iam_member" "app_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "prod-ai-agents-projects"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_iam_member.app_access["WHATSAPP_API_KEY_PROD"] will be created
  + resource "google_secret_manager_secret_iam_member" "app_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = "prod-ai-agents-projects"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_version.secret_versions["GEMINI_API_KEY_PROD"] will be created
  + resource "google_secret_manager_secret_version" "secret_versions" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + version               = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_version.secret_versions["GOOGLE_CLIENT_ID_PROD"] will be created
  + resource "google_secret_manager_secret_version" "secret_versions" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + version               = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_version.secret_versions["GOOGLE_CLIENT_SECRET_PROD"] will be created
  + resource "google_secret_manager_secret_version" "secret_versions" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + version               = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_version.secret_versions["GOOGLE_REFRESH_TOKEN_PROD"] will be created
  + resource "google_secret_manager_secret_version" "secret_versions" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + version               = (known after apply)
    }

  # module.secret_manager.google_secret_manager_secret_version.secret_versions["WHATSAPP_API_KEY_PROD"] will be created
  + resource "google_secret_manager_secret_version" "secret_versions" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + version               = (known after apply)
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + environment           = "prod"
  + secret_ids            = (sensitive value)
  + service_account_email = (known after apply)
  + service_name          = "financia-api"
  + service_url           = (known after apply)

```

</details>

**Status:** No Changes (exit code: 0)

⚠️ **This is the PRODUCTION environment. Review carefully before approving apply.**
